Revit 2025 API
ReturnAirflowType Enumeration
An enumerated type listing all the possible return airflow types for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ReturnAirflowType
Public Enumeration ReturnAirflowType
public enum class ReturnAirflowType
type ReturnAirflowType
Members
Member name | Value | Description
Specified | 0 | Return Airflow Type is Specified.
SpecifiedSupplyAirflow | 1 | Return Airflow Type is SpecifiedSupplyAirflow.
CalculatedSupplyAirflow | 2 | Return Airflow Type is CalculatedSupplyAirflow.
ActualSupplyAirflow | 3 | Return Airflow Type is ActualSupplyAirflow.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace